<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;2&nbsp;High</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I05-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>terraform</td>

<td>TCP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I13-I-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>terraform</td>

<td>Database port TCP/3306 can enter your network from Public IPs   </td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>terraform</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;2&nbsp;High</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I05-I-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Public IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>80</td>

  <td>80</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>8080</td>

  <td>8080</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>80</td>

  <td>80</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>8080</td>

  <td>8080</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>3306</td>

  <td>3306</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I13-I-GCP</summary> 

### **Title:**
Database port TCP/3306 can enter your network from Public IPs   

### **Description:**
Your cloud database managment system is accessible using the MySQL debug port TCP/3306. MySQL is a database managment system (RDBMS). Databases are the elements of Electronic Business, Financial, Banking, and Enterprise Resource Planning (ERP) system, and include critical information from partners, customers, and employees. 
Databases are extremely complex application and are, often times, difficult to correctly configure and secure.  As a result serious security vulnerabilities and mis-configurations frequently go
unchecked or completely undetected. For this reason, allowing direct inbound access to your corporate databases is risky. 

### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>80</td>

  <td>80</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>8080</td>

  <td>8080</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
<tr>

  <td>GCP</td>

  <td>3306</td>

  <td>3306</td>

  <td>tcp</td>

  <td>0.0.0.0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.firewall1 will be created
  + resource "google_compute_firewall" "firewall1" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "wp-firewall"
      + network            = "prod-wp-env"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_tags        = [
          + "wordpress",
          + "wp",
        ]

      + allow {
          + ports    = [
              + "80",
              + "8080",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_firewall.firewall2 will be created
  + resource "google_compute_firewall" "firewall2" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "db-firewall"
      + network            = "prod-db-env"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_tags        = [
          + "database",
          + "db",
        ]

      + allow {
          + ports    = [
              + "80",
              + "8080",
              + "3306",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc_network1 will be created
  + resource "google_compute_network" "vpc_network1" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC Network for WordPress"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "prod-wp-env"
      + project                         = "---Your Project ID here---"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_network.vpc_network2 will be created
  + resource "google_compute_network" "vpc_network2" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC Network For dataBase"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "prod-db-env"
      + project                         = "---Your Project ID here---"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_network_peering.peering1 will be created
  + resource "google_compute_network_peering" "peering1" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = true
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + name                                = "wp-to-db"
      + network                             = (known after apply)
      + peer_network                        = (known after apply)
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

  # google_compute_network_peering.peering2 will be created
  + resource "google_compute_network_peering" "peering2" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = true
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + name                                = "db-to-wp"
      + network                             = (known after apply)
      + peer_network                        = (known after apply)
      + state                               = (known after apply)
      + state_details                       = (known after apply)
    }

  # google_compute_subnetwork.subnetwork1 will be created
  + resource "google_compute_subnetwork" "subnetwork1" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.2.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "wp-subnet"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "---Your Project ID here---"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_compute_subnetwork.subnetwork2 will be created
  + resource "google_compute_subnetwork" "subnetwork2" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.4.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "db-subnet"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "---Your Project ID here---"
      + purpose                    = (known after apply)
      + region                     = "asia-south1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_container_cluster.gke_cluster1 will be created
  + resource "google_container_cluster" "gke_cluster1" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + description                 = "My GKE Cluster"
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "my-cluster"
      + network                     = "prod-wp-env"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "---Your Project ID here---"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "wp-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              + image_type        = (known after apply)
              + oauth_scopes      = (known after apply)
              + service_account   = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + mesh_certificates {
          + enable_certificates = (known after apply)
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + spot              = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + reservation_affinity {
              + consume_reservation_type = (known after apply)
              + key                      = (known after apply)
              + values                   = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + location_policy      = (known after apply)
              + max_node_count       = (known after apply)
              + min_node_count       = (known after apply)
              + total_max_node_count = (known after apply)
              + total_min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)

              + filter {
                  + event_type = (known after apply)
                }
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + service_external_ips_config {
          + enabled = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = (known after apply)
        }
    }

  # google_container_node_pool.nodepool1 will be created
  + resource "google_container_node_pool" "nodepool1" {
      + cluster                     = "my-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "my-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "---Your Project ID here---"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 1
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # google_sql_database.sql_db will be created
  + resource "google_sql_database" "sql_db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "sql1"
      + name      = "wpdb"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database_instance.sqldb_Instance will be created
  + resource "google_sql_database_instance" "sqldb_Instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_5_6"
      + deletion_protection            = true
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "sql1"
      + private_ip_address             = (known after apply)
      + project                        = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-south1"
      + root_password                  = (sensitive value)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled = true

              + authorized_networks {
                  + name  = "sqlnet"
                  + value = "0.0.0.0/0"
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # google_sql_user.dbUser will be created
  + resource "google_sql_user" "dbUser" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "sql1"
      + name                    = "wpuser"
      + password                = (sensitive value)
      + project                 = (known after apply)
      + sql_server_user_details = (known after apply)
    }

  # kubernetes_deployment.wp-dep will be created
  + resource "kubernetes_deployment" "wp-dep" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "env" = "Production"
            }
          + name             = "wp-dep"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "env" = "Production"
                  + "pod" = "wp"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "env" = "Production"
                      + "pod" = "wp"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "wordpress"
                      + image_pull_policy          = (known after apply)
                      + name                       = "wp-container"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "WORDPRESS_DB_HOST"
                        }
                      + env {
                          + name  = "WORDPRESS_DB_USER"
                          + value = "wpuser"
                        }
                      + env {
                          + name  = "WORDPRESS_DB_PASSWORD"
                          + value = "wppass"
                        }
                      + env {
                          + name  = "WORDPRESS_DB_NAME"
                          + value = "wpdb"
                        }
                      + env {
                          + name  = "WORDPRESS_TABLE_PREFIX"
                          + value = "wp_"
                        }

                      + port {
                          + container_port = 80
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.wpService will be created
  + resource "kubernetes_service" "wpService" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "env" = "Production"
            }
          + name             = "wp-svc"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + name        = "wp-port"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = (known after apply)
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # null_resource.configure_kubectl will be created
  + resource "null_resource" "configure_kubectl" {
      + id = (known after apply)
    }

  # null_resource.set_gcloud_project will be created
  + resource "null_resource" "set_gcloud_project" {
      + id = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_name  = "wpdb"
  + db_host        = (known after apply)
  + db_user_name   = "wpuser"
  + db_user_passwd = "wppass"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform\tmp\terraform.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform\\tmp\\terraform.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD